Repository: jurajtrappl/Software-for-nutritional-support-of-healthy-lifestyle
Catalog: src/Web/src/Resources/IdentityErrorResources.*.resx
Languages: sk

source: An external login is already associated with this account.
sk: Externé prihlásenie je už spojené s týmto účtom.

source: Concurrency failure.
sk: Zlyhanie súbežnosti.

source: Email '{0}' already exists.
sk: E-mail '{0}' už existuje.

source: Email '{0}' is invalid.
sk: E-mail '{0}' je neplatný.

source: Identity system error.
sk: Chyba systému Identity.

source: Invalid token.
sk: Neplatný token.

source: Recovery code was not redeemed.
sk: Obnovovací kód nebol uplatnený.

source: Role name '{0}' already exists.
sk: Názov role '{0}' už existuje.

source: Role name '{0}' is invalid.
sk: Názov role '{0}' je neplatný.

source: The password must be at least '{0}' character long.
sk: Heslo musí mať aspoň '{0}' znakov.

source: The password must contain '{0}' unique characters.
sk: Heslo musí obsahovať jedinečné znaky'{0}'.

source: The password must contain digits (0 - 9)
sk: Heslo musí obsahovať číslice (0 - 9)

source: The password must contain lower case letters (a - z)
sk: Heslo musí obsahovať malé písmená (a - z)

source: The password must contain non-alphanumeric characters.
sk: Heslo musí obsahovať nealfanumerické znaky.

source: The password must contain upper case letters (A - Z)
sk: Heslo musí obsahovať veľké písmená (A - Z)

source: The provided password doesn't match your saved password.
sk: Zadané heslo sa nezhoduje s uloženým heslom.

source: The user is already in '{0}' role.
sk: Používateľ už je v role '{0}'.

source: User already has a password.
sk: Používateľ už má heslo.

source: User is not in '{0}' role.
sk: Používateľ nie je v role '{0}'.

source: User lockout is not enabled.
sk: Blokovanie používateľov nie je povolené.

source: User name '{0}' already exists.
sk: Používateľské meno '{0}' už existuje.

source: User name '{0}' is invalid.
sk: Používateľské meno '{0}' je neplatné.
