Repository: jurajtrappl/Software-for-nutritional-support-of-healthy-lifestyle
Catalog: src/Web/src/Resources/Ingredients.*.resx
Languages: cs, sk

source: Almonds
cs: Mandle
sk: Mandle

source: Beans
cs: Fazole
sk: Fazuľa

source: Boneless chicken breast
cs: Vykostěné kuřecí prsa
sk: Kuracie prsia bez kosti

source: Boneless turkey breast
cs: Vykostěná krůtí prsa
sk: Morčacie prsia bez kosti

source: Broccoli
cs: Brokolice
sk: Brokolica

source: Buckwheat
cs: Pohanka (vařená)
sk: Pohánka (varená)

source: Bulgur
cs: Bulgur (vařený)
sk: Bulgur (varený)

source: Carrot
cs: Mrkev
sk: Mrkva

source: Cashews
cs: Kešu oříšky
sk: Kešu

source: Cauliflower
cs: Květák
sk: Karfiol

source: Cereal kaiser roll
cs: Cereální kaiserka
sk: Cereálna kaiserka

source: China orange
cs: Mandarinka
sk: Mandarínka

source: Couscous
cs: Kuskus (vařený)
sk: Kuskus (varený)

source: Cucumber
cs: Okurka
sk: Uhorka

source: Egg white
cs: Bílek
sk: Vaječný bielok

source: Eggplant
cs: Baklažán
sk: Baklažán

source: Fish fillet
cs: Rybí filé
sk: Rybie filé

source: Flax oil
cs: Lněný olej
sk: Ľanový olej

source: Ghee butter
cs: Máslo ghee
sk: Maslo ghee

source: Gluten free bread
cs: Bezlepkový chléb
sk: Bezlepkový chlieb

source: Gluten free bread roll
cs: Bezlepkový rohlík
sk: Bezlepkový rožok

source: Gluten free kaiser roll
cs: Bezlepková kaiserka
sk: Bezlepková kaiserka

source: Graham bread
cs: Grahamový chléb
sk: Grahamový chlieb

source: Graham pasta
cs: Grahamové těstoviny (vařené)
sk: Grahamové cestoviny (varené)

source: Grape
cs: Hrozny
sk: Hrozno

source: Greek yogurt
cs: Řecký jogurt
sk: Grécky jogurt

source: Ham 95%
cs: Šunka (95% maso)
sk: Šunka (95% mäso)

source: Honey
cs: Med
sk: Med

source: Iceberg lettuce
cs: Ledový salát
sk: Ľadový šalát

source: Millet
cs: Jáhly (vařené)
sk: Proso (varené)

source: Olive oil
cs: Olivový olej
sk: Olivový olej

source: Orange
cs: Pomeranč
sk: Pomaranč

source: Paddy rice
cs: Neloupaná rýže (vařená)
sk: Ryža nelúpaná (varená)

source: Pea pasta
cs: Hráchové těstoviny (vařené)
sk: Hrachové cestoviny (varené)

source: Peanuts
cs: Arašídy
sk: Arašidy

source: Potatoes
cs: Brambory
sk: Zemiaky

source: Protein powder
cs: Proteinový prášek
sk: Proteínový prášok

source: Quinoa
cs: Quinoa (vařená)
sk: Quinoa (varená)

source: Rabbit meat
cs: Králičí maso
sk: Králičie mäso

source: Rapeseed oil
cs: Řepkový olej
sk: Repkový olej

source: Rumpsteak
cs: Zadní hovězí
sk: Hovädzie zadné

source: Rye knäckebrot
cs: Žitný knäckebrot
sk: Žitný knäckebrot

source: Rye whole-grain bread
cs: Žitný celozrnný chléb
sk: Žitný celozrnný chlieb

source: Salmon
cs: Losos
sk: Losos

source: Salmon radish
cs: Ředkev
sk: Reďkovka

source: Sesame oil
cs: Sezamový olej
sk: Sezamový olej

source: Smoked tofu
cs: Uzené tofu
sk: Údené tofu

source: Soft semi-fat cottage cheese
cs: Měkký polotučný tvaroh
sk: Mäkký polotučný tvaroh

source: Sourdough rye bread
cs: Kváskový žitný chléb
sk: Žitný kváskový chlieb

source: Soy bread roll
cs: Sójový rohlík
sk: Sójový rožok

source: Tomatoes
cs: Rajčata
sk: Paradajky

source: Trout
cs: Pstruh
sk: Pstruh

source: Tuna in its own juice
cs: Tuňák ve vlastní šťávě
sk: Tuniak vo vlastnej šťave

source: Walnuts
cs: Vlašské ořechy
sk: Vlašské orechy

source: Whole-grain bread roll
cs: Celozrnný rohlík
sk: Celozrnný rožok

source: Zucchini
cs: Cuketa
sk: Cuketa
